Revit 2026 API

# RebarFreeFormAccessorGetShapeIdAtIndex Method

---

Gets the Rebar Shape id for the bar with index barPositionIndex.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetShapeIdAtIndex(
	int barPositionIndex
)
```
```vb
Public Function GetShapeIdAtIndex (
	barPositionIndex As Integer
) As ElementId
```
```cpp
public:
ElementId^ GetShapeIdAtIndex(
	int barPositionIndex
)
```
```fsharp
member GetShapeIdAtIndex :
        barPositionIndex : int -> ElementId
```

#### Parameters

barPositionIndex Int32
     An index between 0 and (NumberOfBarPositions-1).

#### Return Value

ElementId Gets the ElementId of the Rebar Shape for the bar with index barPositionIndex.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. -or- The bar at barPositionIndex index is excluded. |

If this function is called for a bar that isn't included, this function will throw exception.

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace